tests/test_xmls/test_run_ps_with_responses/7-request.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:a="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:w="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd" xmlns:wsmid="http://schemas.dmtf.org/wbem/wsman/identify/1/wsmanidentity.xsd" xmlns:wsmanfault="http://schemas.microsoft.com/wbem/wsman/1/wsmanfault" xmlns:cim="http://schemas.dmtf.org/wbem/wscim/1/common" xmlns:p="http://schemas.microsoft.com/wbem/wsman/1/wsman.xsd" xmlns:cfg="http://schemas.microsoft.com/wbem/wsman/1/config" xmlns:sub="http://schemas.microsoft.com/wbem/wsman/1/subscription" xmlns:rsp="http://schemas.microsoft.com/wbem/wsman/1/windows/shell" xmlns:m="http://schemas.microsoft.com/wbem/wsman/1/machineid" xmlns:cert="http://schemas.microsoft.com/wbem/wsman/1/config/service/certmapping" xmlns:plugin="http://schemas.microsoft.com/wbem/wsman/1/config/PluginConfiguration" xmlns:wsen="http://schemas.xmlsoap.org/ws/2004/09/enumeration" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing" xmlns:i="http://schemas.microsoft.com/wbem/wsman/1/cim/interactive.xsd">
<s:Header>
    <a:Action s:mustUnderstand="true">http://schemas.microsoft.com/wbem/wsman/1/windows/shell/Send</a:Action>
    <p:DataLocale s:mustUnderstand="false" xml:lang="en-US"/>
    <w:Locale s:mustUnderstand="false" xml:lang="en-US"/>
    <a:To>https://windows-host:5986/wsman</a:To>
    <w:ResourceURI s:mustUnderstand="true">http://schemas.microsoft.com/powershell/Microsoft.PowerShell</w:ResourceURI>
    <w:OperationTimeout>PT20S</w:OperationTimeout>
    <a:ReplyTo>
        <a:Address s:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</a:Address>
    </a:ReplyTo>
    <w:MaxEnvelopeSize>512000</w:MaxEnvelopeSize>
    <a:MessageID>uuid:11111111-1111-1111-1111-111111111111</a:MessageID>
    <p:SessionId s:mustUnderstand="false">uuid:11111111-1111-1111-1111-111111111111</p:SessionId>
    <w:SelectorSet>
        <w:Selector Name="ShellId">11111111-1111-1111-1111-111111111111</w:Selector>
    </w:SelectorSet>
</s:Header>
<s:Body>
    <rsp:Send>
        <rsp:Stream CommandId="11111111-1111-1111-1111-111111111111" Name="pr">AAAAAAAAAAQAAAAAAAAAAAMAAAIEAgAAAAERBAAREREREREREREREREREREREREREREREREREREREREREe+7vzxPYmogUmVmSWQ9IjI4NjMzMTE1MyI+PE1TPjxPYmogUmVmSWQ9IjI4NjMzMTE1MyIgTj0ibXIiPjxUTiBSZWZJZD0iMjg2MzMxMTUzIj48VD5TeXN0ZW0uQ29sbGVjdGlvbnMuSGFzaHRhYmxlPC9UPjxUPlN5c3RlbS5PYmplY3Q8L1Q+PC9UTj48RENUPjxFbj48UyBOPSJLZXkiPm1lc3NhZ2U8L1M+PFMgTj0iVmFsdWUiPmZpcnN0IHByb21wdDwvUz48L0VuPjwvRENUPjwvT2JqPjxPYmogUmVmSWQ9IjI4NjMzMTE1MyIgTj0ibWkiPjxUTiBSZWZJZD0iMjg2MzMxMTUzIj48VD5TeXN0ZW0uTWFuYWdlbWVudC5BdXRvbWF0aW9uLlJlbW90aW5nLlJlbW90ZUhvc3RNZXRob2RJZDwvVD48VD5TeXN0ZW0uRW51bTwvVD48VD5TeXN0ZW0uVmFsdWVUeXBlPC9UPjxUPlN5c3RlbS5PYmplY3Q8L1Q+PC9UTj48VG9TdHJpbmc+UHJvbXB0PC9Ub1N0cmluZz48STMyPjIzPC9JMzI+PC9PYmo+PEk2NCBOPSJjaSI+MTwvSTY0PjwvTVM+PC9PYmo+</rsp:Stream>
    </rsp:Send>
</s:Body>
</s:Envelope>
